; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p2---int100n150-m25---int100c150---s23---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level8 level8)
(sum level0 level9 level9)
(sum level0 level10 level10)
(sum level0 level16 level16)
(sum level0 level20 level20)
(sum level0 level24 level24)
(sum level1 level2 level3)
(sum level1 level8 level9)
(sum level1 level9 level10)
(sum level1 level10 level11)
(sum level1 level16 level17)
(sum level1 level20 level21)
(sum level1 level24 level25)
(sum level2 level2 level4)
(sum level2 level8 level10)
(sum level2 level9 level11)
(sum level2 level10 level12)
(sum level2 level16 level18)
(sum level2 level20 level22)
(sum level2 level24 level26)
(sum level3 level2 level5)
(sum level3 level8 level11)
(sum level3 level9 level12)
(sum level3 level10 level13)
(sum level3 level16 level19)
(sum level3 level20 level23)
(sum level3 level24 level27)
(sum level4 level2 level6)
(sum level4 level8 level12)
(sum level4 level9 level13)
(sum level4 level10 level14)
(sum level4 level16 level20)
(sum level4 level20 level24)
(sum level4 level24 level28)
(sum level5 level2 level7)
(sum level5 level8 level13)
(sum level5 level9 level14)
(sum level5 level10 level15)
(sum level5 level16 level21)
(sum level5 level20 level25)
(sum level5 level24 level29)
(sum level6 level2 level8)
(sum level6 level8 level14)
(sum level6 level9 level15)
(sum level6 level10 level16)
(sum level6 level16 level22)
(sum level6 level20 level26)
(sum level6 level24 level30)
(sum level7 level2 level9)
(sum level7 level8 level15)
(sum level7 level9 level16)
(sum level7 level10 level17)
(sum level7 level16 level23)
(sum level7 level20 level27)
(sum level7 level24 level31)
(sum level8 level2 level10)
(sum level8 level8 level16)
(sum level8 level9 level17)
(sum level8 level10 level18)
(sum level8 level16 level24)
(sum level8 level20 level28)
(sum level8 level24 level32)
(sum level9 level2 level11)
(sum level9 level8 level17)
(sum level9 level9 level18)
(sum level9 level10 level19)
(sum level9 level16 level25)
(sum level9 level20 level29)
(sum level9 level24 level33)
(sum level10 level2 level12)
(sum level10 level8 level18)
(sum level10 level9 level19)
(sum level10 level10 level20)
(sum level10 level16 level26)
(sum level10 level20 level30)
(sum level10 level24 level34)
(sum level11 level2 level13)
(sum level11 level8 level19)
(sum level11 level9 level20)
(sum level11 level10 level21)
(sum level11 level16 level27)
(sum level11 level20 level31)
(sum level11 level24 level35)
(sum level12 level2 level14)
(sum level12 level8 level20)
(sum level12 level9 level21)
(sum level12 level10 level22)
(sum level12 level16 level28)
(sum level12 level20 level32)
(sum level12 level24 level36)
(sum level13 level2 level15)
(sum level13 level8 level21)
(sum level13 level9 level22)
(sum level13 level10 level23)
(sum level13 level16 level29)
(sum level13 level20 level33)
(sum level13 level24 level37)
(sum level14 level2 level16)
(sum level14 level8 level22)
(sum level14 level9 level23)
(sum level14 level10 level24)
(sum level14 level16 level30)
(sum level14 level20 level34)
(sum level14 level24 level38)
(sum level15 level2 level17)
(sum level15 level8 level23)
(sum level15 level9 level24)
(sum level15 level10 level25)
(sum level15 level16 level31)
(sum level15 level20 level35)
(sum level15 level24 level39)
(sum level16 level2 level18)
(sum level16 level8 level24)
(sum level16 level9 level25)
(sum level16 level10 level26)
(sum level16 level16 level32)
(sum level16 level20 level36)
(sum level16 level24 level40)
(sum level17 level2 level19)
(sum level17 level8 level25)
(sum level17 level9 level26)
(sum level17 level10 level27)
(sum level17 level16 level33)
(sum level17 level20 level37)
(sum level17 level24 level41)
(sum level18 level2 level20)
(sum level18 level8 level26)
(sum level18 level9 level27)
(sum level18 level10 level28)
(sum level18 level16 level34)
(sum level18 level20 level38)
(sum level18 level24 level42)
(sum level19 level2 level21)
(sum level19 level8 level27)
(sum level19 level9 level28)
(sum level19 level10 level29)
(sum level19 level16 level35)
(sum level19 level20 level39)
(sum level19 level24 level43)
(sum level20 level2 level22)
(sum level20 level8 level28)
(sum level20 level9 level29)
(sum level20 level10 level30)
(sum level20 level16 level36)
(sum level20 level20 level40)
(sum level20 level24 level44)
(sum level21 level2 level23)
(sum level21 level8 level29)
(sum level21 level9 level30)
(sum level21 level10 level31)
(sum level21 level16 level37)
(sum level21 level20 level41)
(sum level21 level24 level45)
(sum level22 level2 level24)
(sum level22 level8 level30)
(sum level22 level9 level31)
(sum level22 level10 level32)
(sum level22 level16 level38)
(sum level22 level20 level42)
(sum level22 level24 level46)
(sum level23 level2 level25)
(sum level23 level8 level31)
(sum level23 level9 level32)
(sum level23 level10 level33)
(sum level23 level16 level39)
(sum level23 level20 level43)
(sum level23 level24 level47)
(sum level24 level2 level26)
(sum level24 level8 level32)
(sum level24 level9 level33)
(sum level24 level10 level34)
(sum level24 level16 level40)
(sum level24 level20 level44)
(sum level24 level24 level48)
(sum level25 level2 level27)
(sum level25 level8 level33)
(sum level25 level9 level34)
(sum level25 level10 level35)
(sum level25 level16 level41)
(sum level25 level20 level45)
(sum level25 level24 level49)
(sum level26 level2 level28)
(sum level26 level8 level34)
(sum level26 level9 level35)
(sum level26 level10 level36)
(sum level26 level16 level42)
(sum level26 level20 level46)
(sum level26 level24 level50)
(sum level27 level2 level29)
(sum level27 level8 level35)
(sum level27 level9 level36)
(sum level27 level10 level37)
(sum level27 level16 level43)
(sum level27 level20 level47)
(sum level27 level24 level51)
(sum level28 level2 level30)
(sum level28 level8 level36)
(sum level28 level9 level37)
(sum level28 level10 level38)
(sum level28 level16 level44)
(sum level28 level20 level48)
(sum level28 level24 level52)
(sum level29 level2 level31)
(sum level29 level8 level37)
(sum level29 level9 level38)
(sum level29 level10 level39)
(sum level29 level16 level45)
(sum level29 level20 level49)
(sum level29 level24 level53)
(sum level30 level2 level32)
(sum level30 level8 level38)
(sum level30 level9 level39)
(sum level30 level10 level40)
(sum level30 level16 level46)
(sum level30 level20 level50)
(sum level30 level24 level54)
(sum level31 level2 level33)
(sum level31 level8 level39)
(sum level31 level9 level40)
(sum level31 level10 level41)
(sum level31 level16 level47)
(sum level31 level20 level51)
(sum level31 level24 level55)
(sum level32 level2 level34)
(sum level32 level8 level40)
(sum level32 level9 level41)
(sum level32 level10 level42)
(sum level32 level16 level48)
(sum level32 level20 level52)
(sum level32 level24 level56)
(sum level33 level2 level35)
(sum level33 level8 level41)
(sum level33 level9 level42)
(sum level33 level10 level43)
(sum level33 level16 level49)
(sum level33 level20 level53)
(sum level33 level24 level57)
(sum level34 level2 level36)
(sum level34 level8 level42)
(sum level34 level9 level43)
(sum level34 level10 level44)
(sum level34 level16 level50)
(sum level34 level20 level54)
(sum level34 level24 level58)
(sum level35 level2 level37)
(sum level35 level8 level43)
(sum level35 level9 level44)
(sum level35 level10 level45)
(sum level35 level16 level51)
(sum level35 level20 level55)
(sum level35 level24 level59)
(sum level36 level2 level38)
(sum level36 level8 level44)
(sum level36 level9 level45)
(sum level36 level10 level46)
(sum level36 level16 level52)
(sum level36 level20 level56)
(sum level36 level24 level60)
(sum level37 level2 level39)
(sum level37 level8 level45)
(sum level37 level9 level46)
(sum level37 level10 level47)
(sum level37 level16 level53)
(sum level37 level20 level57)
(sum level37 level24 level61)
(sum level38 level2 level40)
(sum level38 level8 level46)
(sum level38 level9 level47)
(sum level38 level10 level48)
(sum level38 level16 level54)
(sum level38 level20 level58)
(sum level38 level24 level62)
(sum level39 level2 level41)
(sum level39 level8 level47)
(sum level39 level9 level48)
(sum level39 level10 level49)
(sum level39 level16 level55)
(sum level39 level20 level59)
(sum level39 level24 level63)
(sum level40 level2 level42)
(sum level40 level8 level48)
(sum level40 level9 level49)
(sum level40 level10 level50)
(sum level40 level16 level56)
(sum level40 level20 level60)
(sum level40 level24 level64)
(sum level41 level2 level43)
(sum level41 level8 level49)
(sum level41 level9 level50)
(sum level41 level10 level51)
(sum level41 level16 level57)
(sum level41 level20 level61)
(sum level42 level2 level44)
(sum level42 level8 level50)
(sum level42 level9 level51)
(sum level42 level10 level52)
(sum level42 level16 level58)
(sum level42 level20 level62)
(sum level43 level2 level45)
(sum level43 level8 level51)
(sum level43 level9 level52)
(sum level43 level10 level53)
(sum level43 level16 level59)
(sum level43 level20 level63)
(sum level44 level2 level46)
(sum level44 level8 level52)
(sum level44 level9 level53)
(sum level44 level10 level54)
(sum level44 level16 level60)
(sum level44 level20 level64)
(sum level45 level2 level47)
(sum level45 level8 level53)
(sum level45 level9 level54)
(sum level45 level10 level55)
(sum level45 level16 level61)
(sum level46 level2 level48)
(sum level46 level8 level54)
(sum level46 level9 level55)
(sum level46 level10 level56)
(sum level46 level16 level62)
(sum level47 level2 level49)
(sum level47 level8 level55)
(sum level47 level9 level56)
(sum level47 level10 level57)
(sum level47 level16 level63)
(sum level48 level2 level50)
(sum level48 level8 level56)
(sum level48 level9 level57)
(sum level48 level10 level58)
(sum level48 level16 level64)
(sum level49 level2 level51)
(sum level49 level8 level57)
(sum level49 level9 level58)
(sum level49 level10 level59)
(sum level50 level2 level52)
(sum level50 level8 level58)
(sum level50 level9 level59)
(sum level50 level10 level60)
(sum level51 level2 level53)
(sum level51 level8 level59)
(sum level51 level9 level60)
(sum level51 level10 level61)
(sum level52 level2 level54)
(sum level52 level8 level60)
(sum level52 level9 level61)
(sum level52 level10 level62)
(sum level53 level2 level55)
(sum level53 level8 level61)
(sum level53 level9 level62)
(sum level53 level10 level63)
(sum level54 level2 level56)
(sum level54 level8 level62)
(sum level54 level9 level63)
(sum level54 level10 level64)
(sum level55 level2 level57)
(sum level55 level8 level63)
(sum level55 level9 level64)
(sum level56 level2 level58)
(sum level56 level8 level64)
(sum level57 level2 level59)
(sum level58 level2 level60)
(sum level59 level2 level61)
(sum level60 level2 level62)
(sum level61 level2 level63)
(sum level62 level2 level64)

(connected l0 l1)
(fuelcost level2 l0 l1)
(connected l0 l3)
(fuelcost level9 l0 l3)
(connected l0 l4)
(fuelcost level20 l0 l4)
(connected l1 l0)
(fuelcost level2 l1 l0)
(connected l1 l3)
(fuelcost level24 l1 l3)
(connected l2 l3)
(fuelcost level9 l2 l3)
(connected l2 l4)
(fuelcost level10 l2 l4)
(connected l3 l0)
(fuelcost level9 l3 l0)
(connected l3 l1)
(fuelcost level24 l3 l1)
(connected l3 l2)
(fuelcost level9 l3 l2)
(connected l3 l4)
(fuelcost level16 l3 l4)
(connected l3 l5)
(fuelcost level8 l3 l5)
(connected l4 l0)
(fuelcost level20 l4 l0)
(connected l4 l2)
(fuelcost level10 l4 l2)
(connected l4 l3)
(fuelcost level16 l4 l3)
(connected l4 l5)
(fuelcost level20 l4 l5)
(connected l5 l3)
(fuelcost level8 l5 l3)
(connected l5 l4)
(fuelcost level20 l5 l4)

(at t0 l3)
(fuel t0 level64)
(= (total-cost) 0)

(at p0 l2)
(at p1 l5)
)

(:goal
(and
(at p0 l3)
(at p1 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l3 l2 level55 level9 level64)
   deleted: (at t0 l3) (fuel t0 level64)
   added: (at t0 l2) (fuel t0 level55)
   goals met: 0 of 2
2. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 0 of 2
3. (drive t0 l2 l3 level46 level9 level55)
   deleted: (at t0 l2) (fuel t0 level55)
   added: (at t0 l3) (fuel t0 level46)
   goals met: 0 of 2
4. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 1 of 2
5. (drive t0 l3 l5 level38 level8 level46)
   deleted: (at t0 l3) (fuel t0 level46)
   added: (at t0 l5) (fuel t0 level38)
   goals met: 1 of 2
6. (load p1 t0 l5)
   deleted: (at p1 l5)
   added: (in p1 t0)
   goals met: 1 of 2
7. (drive t0 l5 l3 level30 level8 level38)
   deleted: (at t0 l5) (fuel t0 level38)
   added: (at t0 l3) (fuel t0 level30)
   goals met: 1 of 2
8. (drive t0 l3 l0 level21 level9 level30)
   deleted: (at t0 l3) (fuel t0 level30)
   added: (at t0 l0) (fuel t0 level21)
   goals met: 1 of 2
9. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 2 of 2
